Microchip-MPLAB-Harmony/csp/apps/cache/cache_maintenance/firmware/src/packs/ATSAMA5D27_DFP/component/l2cc.h
/**
 * \brief Component description for L2CC
 *
 * Copyright (c) 2018 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2018-11-28T22:21:13Z */
#ifndef _SAMA5D2_L2CC_COMPONENT_H_
#define _SAMA5D2_L2CC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR L2CC                                         */
/* ************************************************************************** */

/* -------- L2CC_IDR : (L2CC Offset: 0x00) ( R/ 32) Cache ID Register -------- */
#define L2CC_IDR_ID_Pos                       _U_(0)                                               /**< (L2CC_IDR) Cache Controller ID Position */
#define L2CC_IDR_ID_Msk                       (_U_(0xFFFFFFFF) << L2CC_IDR_ID_Pos)                 /**< (L2CC_IDR) Cache Controller ID Mask */
#define L2CC_IDR_ID(value)                    (L2CC_IDR_ID_Msk & ((value) << L2CC_IDR_ID_Pos))    
#define L2CC_IDR_Msk                          _U_(0xFFFFFFFF)                                      /**< (L2CC_IDR) Register Mask  */


/* -------- L2CC_TYPR : (L2CC Offset: 0x04) ( R/ 32) Cache Type Register -------- */
#define L2CC_TYPR_IL2ASS_Pos                  _U_(6)                                               /**< (L2CC_TYPR) Instruction L2 Cache Associativity Position */
#define L2CC_TYPR_IL2ASS_Msk                  (_U_(0x1) << L2CC_TYPR_IL2ASS_Pos)                   /**< (L2CC_TYPR) Instruction L2 Cache Associativity Mask */
#define L2CC_TYPR_IL2ASS(value)               (L2CC_TYPR_IL2ASS_Msk & ((value) << L2CC_TYPR_IL2ASS_Pos))
#define L2CC_TYPR_IL2WSIZE_Pos                _U_(8)                                               /**< (L2CC_TYPR) Instruction L2 Cache Way Size Position */
#define L2CC_TYPR_IL2WSIZE_Msk                (_U_(0x7) << L2CC_TYPR_IL2WSIZE_Pos)                 /**< (L2CC_TYPR) Instruction L2 Cache Way Size Mask */
#define L2CC_TYPR_IL2WSIZE(value)             (L2CC_TYPR_IL2WSIZE_Msk & ((value) << L2CC_TYPR_IL2WSIZE_Pos))
#define L2CC_TYPR_DL2ASS_Pos                  _U_(18)                                              /**< (L2CC_TYPR) Data L2 Cache Associativity Position */
#define L2CC_TYPR_DL2ASS_Msk                  (_U_(0x1) << L2CC_TYPR_DL2ASS_Pos)                   /**< (L2CC_TYPR) Data L2 Cache Associativity Mask */
#define L2CC_TYPR_DL2ASS(value)               (L2CC_TYPR_DL2ASS_Msk & ((value) << L2CC_TYPR_DL2ASS_Pos))
#define L2CC_TYPR_DL2WSIZE_Pos                _U_(20)                                              /**< (L2CC_TYPR) Data L2 Cache Way Size Position */
#define L2CC_TYPR_DL2WSIZE_Msk                (_U_(0x7) << L2CC_TYPR_DL2WSIZE_Pos)                 /**< (L2CC_TYPR) Data L2 Cache Way Size Mask */
#define L2CC_TYPR_DL2WSIZE(value)             (L2CC_TYPR_DL2WSIZE_Msk & ((value) << L2CC_TYPR_DL2WSIZE_Pos))
#define L2CC_TYPR_Msk                         _U_(0x00740740)                                      /**< (L2CC_TYPR) Register Mask  */


/* -------- L2CC_CR : (L2CC Offset: 0x100) (R/W 32) Control Register -------- */
#define L2CC_CR_L2CEN_Pos                     _U_(0)                                               /**< (L2CC_CR) L2 Cache Enable Position */
#define L2CC_CR_L2CEN_Msk                     (_U_(0x1) << L2CC_CR_L2CEN_Pos)                      /**< (L2CC_CR) L2 Cache Enable Mask */
#define L2CC_CR_L2CEN(value)                  (L2CC_CR_L2CEN_Msk & ((value) << L2CC_CR_L2CEN_Pos))
#define L2CC_CR_Msk                           _U_(0x00000001)                                      /**< (L2CC_CR) Register Mask  */


/* -------- L2CC_ACR : (L2CC Offset: 0x104) (R/W 32) Auxiliary Control Register -------- */
#define L2CC_ACR_HPSO_Pos                     _U_(10)                                              /**< (L2CC_ACR) High Priority for SO and Dev Reads Enable Position */
#define L2CC_ACR_HPSO_Msk                     (_U_(0x1) << L2CC_ACR_HPSO_Pos)                      /**< (L2CC_ACR) High Priority for SO and Dev Reads Enable Mask */
#define L2CC_ACR_HPSO(value)                  (L2CC_ACR_HPSO_Msk & ((value) << L2CC_ACR_HPSO_Pos))
#define L2CC_ACR_SBDLE_Pos                    _U_(11)                                              /**< (L2CC_ACR) Store Buffer Device Limitation Enable Position */
#define L2CC_ACR_SBDLE_Msk                    (_U_(0x1) << L2CC_ACR_SBDLE_Pos)                     /**< (L2CC_ACR) Store Buffer Device Limitation Enable Mask */
#define L2CC_ACR_SBDLE(value)                 (L2CC_ACR_SBDLE_Msk & ((value) << L2CC_ACR_SBDLE_Pos))
#define L2CC_ACR_EXCC_Pos                     _U_(12)                                              /**< (L2CC_ACR) Exclusive Cache Configuration Position */
#define L2CC_ACR_EXCC_Msk                     (_U_(0x1) << L2CC_ACR_EXCC_Pos)                      /**< (L2CC_ACR) Exclusive Cache Configuration Mask */
#define L2CC_ACR_EXCC(value)                  (L2CC_ACR_EXCC_Msk & ((value) << L2CC_ACR_EXCC_Pos))
#define L2CC_ACR_SAIE_Pos                     _U_(13)                                              /**< (L2CC_ACR) Shared Attribute Invalidate Enable Position */
#define L2CC_ACR_SAIE_Msk                     (_U_(0x1) << L2CC_ACR_SAIE_Pos)                      /**< (L2CC_ACR) Shared Attribute Invalidate Enable Mask */
#define L2CC_ACR_SAIE(value)                  (L2CC_ACR_SAIE_Msk & ((value) << L2CC_ACR_SAIE_Pos))
#define L2CC_ACR_ASS_Pos                      _U_(16)                                              /**< (L2CC_ACR) Associativity Position */
#define L2CC_ACR_ASS_Msk                      (_U_(0x1) << L2CC_ACR_ASS_Pos)                       /**< (L2CC_ACR) Associativity Mask */
#define L2CC_ACR_ASS(value)                   (L2CC_ACR_ASS_Msk & ((value) << L2CC_ACR_ASS_Pos))
#define L2CC_ACR_WAYSIZE_Pos                  _U_(17)                                              /**< (L2CC_ACR) Way Size Position */
#define L2CC_ACR_WAYSIZE_Msk                  (_U_(0x7) << L2CC_ACR_WAYSIZE_Pos)                   /**< (L2CC_ACR) Way Size Mask */
#define L2CC_ACR_WAYSIZE(value)               (L2CC_ACR_WAYSIZE_Msk & ((value) << L2CC_ACR_WAYSIZE_Pos))
#define   L2CC_ACR_WAYSIZE_16KB_WAY_Val       _U_(0x1)                                             /**< (L2CC_ACR) 16-Kbyte way set associative  */
#define L2CC_ACR_WAYSIZE_16KB_WAY             (L2CC_ACR_WAYSIZE_16KB_WAY_Val << L2CC_ACR_WAYSIZE_Pos) /**< (L2CC_ACR) 16-Kbyte way set associative Position  */
#define L2CC_ACR_EMBEN_Pos                    _U_(20)                                              /**< (L2CC_ACR) Event Monitor Bus Enable Position */
#define L2CC_ACR_EMBEN_Msk                    (_U_(0x1) << L2CC_ACR_EMBEN_Pos)                     /**< (L2CC_ACR) Event Monitor Bus Enable Mask */
#define L2CC_ACR_EMBEN(value)                 (L2CC_ACR_EMBEN_Msk & ((value) << L2CC_ACR_EMBEN_Pos))
#define L2CC_ACR_PEN_Pos                      _U_(21)                                              /**< (L2CC_ACR) Parity Enable Position */
#define L2CC_ACR_PEN_Msk                      (_U_(0x1) << L2CC_ACR_PEN_Pos)                       /**< (L2CC_ACR) Parity Enable Mask */
#define L2CC_ACR_PEN(value)                   (L2CC_ACR_PEN_Msk & ((value) << L2CC_ACR_PEN_Pos))
#define L2CC_ACR_SAOEN_Pos                    _U_(22)                                              /**< (L2CC_ACR) Shared Attribute Override Enable Position */
#define L2CC_ACR_SAOEN_Msk                    (_U_(0x1) << L2CC_ACR_SAOEN_Pos)                     /**< (L2CC_ACR) Shared Attribute Override Enable Mask */
#define L2CC_ACR_SAOEN(value)                 (L2CC_ACR_SAOEN_Msk & ((value) << L2CC_ACR_SAOEN_Pos))
#define L2CC_ACR_FWA_Pos                      _U_(23)                                              /**< (L2CC_ACR) Force Write Allocate Position */
#define L2CC_ACR_FWA_Msk                      (_U_(0x3) << L2CC_ACR_FWA_Pos)                       /**< (L2CC_ACR) Force Write Allocate Mask */
#define L2CC_ACR_FWA(value)                   (L2CC_ACR_FWA_Msk & ((value) << L2CC_ACR_FWA_Pos))
#define L2CC_ACR_CRPOL_Pos                    _U_(25)                                              /**< (L2CC_ACR) Cache Replacement Policy Position */
#define L2CC_ACR_CRPOL_Msk                    (_U_(0x1) << L2CC_ACR_CRPOL_Pos)                     /**< (L2CC_ACR) Cache Replacement Policy Mask */
#define L2CC_ACR_CRPOL(value)                 (L2CC_ACR_CRPOL_Msk & ((value) << L2CC_ACR_CRPOL_Pos))
#define L2CC_ACR_NSLEN_Pos                    _U_(26)                                              /**< (L2CC_ACR) Non-Secure Lockdown Enable Position */
#define L2CC_ACR_NSLEN_Msk                    (_U_(0x1) << L2CC_ACR_NSLEN_Pos)                     /**< (L2CC_ACR) Non-Secure Lockdown Enable Mask */
#define L2CC_ACR_NSLEN(value)                 (L2CC_ACR_NSLEN_Msk & ((value) << L2CC_ACR_NSLEN_Pos))
#define L2CC_ACR_NSIAC_Pos                    _U_(27)                                              /**< (L2CC_ACR) Non-Secure Interrupt Access Control Position */
#define L2CC_ACR_NSIAC_Msk                    (_U_(0x1) << L2CC_ACR_NSIAC_Pos)                     /**< (L2CC_ACR) Non-Secure Interrupt Access Control Mask */
#define L2CC_ACR_NSIAC(value)                 (L2CC_ACR_NSIAC_Msk & ((value) << L2CC_ACR_NSIAC_Pos))
#define L2CC_ACR_DPEN_Pos                     _U_(28)                                              /**< (L2CC_ACR) Data Prefetch Enable Position */
#define L2CC_ACR_DPEN_Msk                     (_U_(0x1) << L2CC_ACR_DPEN_Pos)                      /**< (L2CC_ACR) Data Prefetch Enable Mask */
#define L2CC_ACR_DPEN(value)                  (L2CC_ACR_DPEN_Msk & ((value) << L2CC_ACR_DPEN_Pos))
#define L2CC_ACR_IPEN_Pos                     _U_(29)                                              /**< (L2CC_ACR) Instruction Prefetch Enable Position */
#define L2CC_ACR_IPEN_Msk                     (_U_(0x1) << L2CC_ACR_IPEN_Pos)                      /**< (L2CC_ACR) Instruction Prefetch Enable Mask */
#define L2CC_ACR_IPEN(value)                  (L2CC_ACR_IPEN_Msk & ((value) << L2CC_ACR_IPEN_Pos))
#define L2CC_ACR_Msk                          _U_(0x3FFF3C00)                                      /**< (L2CC_ACR) Register Mask  */


/* -------- L2CC_TRCR : (L2CC Offset: 0x108) (R/W 32) Tag RAM Control Register -------- */
#define L2CC_TRCR_TSETLAT_Pos                 _U_(0)                                               /**< (L2CC_TRCR) Setup Latency Position */
#define L2CC_TRCR_TSETLAT_Msk                 (_U_(0x7) << L2CC_TRCR_TSETLAT_Pos)                  /**< (L2CC_TRCR) Setup Latency Mask */
#define L2CC_TRCR_TSETLAT(value)              (L2CC_TRCR_TSETLAT_Msk & ((value) << L2CC_TRCR_TSETLAT_Pos))
#define L2CC_TRCR_TRDLAT_Pos                  _U_(4)                                               /**< (L2CC_TRCR) Read Access Latency Position */
#define L2CC_TRCR_TRDLAT_Msk                  (_U_(0x7) << L2CC_TRCR_TRDLAT_Pos)                   /**< (L2CC_TRCR) Read Access Latency Mask */
#define L2CC_TRCR_TRDLAT(value)               (L2CC_TRCR_TRDLAT_Msk & ((value) << L2CC_TRCR_TRDLAT_Pos))
#define L2CC_TRCR_TWRLAT_Pos                  _U_(8)                                               /**< (L2CC_TRCR) Write Access Latency Position */
#define L2CC_TRCR_TWRLAT_Msk                  (_U_(0x7) << L2CC_TRCR_TWRLAT_Pos)                   /**< (L2CC_TRCR) Write Access Latency Mask */
#define L2CC_TRCR_TWRLAT(value)               (L2CC_TRCR_TWRLAT_Msk & ((value) << L2CC_TRCR_TWRLAT_Pos))
#define L2CC_TRCR_Msk                         _U_(0x00000777)                                      /**< (L2CC_TRCR) Register Mask  */


/* -------- L2CC_DRCR : (L2CC Offset: 0x10C) (R/W 32) Data RAM Control Register -------- */
#define L2CC_DRCR_DSETLAT_Pos                 _U_(0)                                               /**< (L2CC_DRCR) Setup Latency Position */
#define L2CC_DRCR_DSETLAT_Msk                 (_U_(0x7) << L2CC_DRCR_DSETLAT_Pos)                  /**< (L2CC_DRCR) Setup Latency Mask */
#define L2CC_DRCR_DSETLAT(value)              (L2CC_DRCR_DSETLAT_Msk & ((value) << L2CC_DRCR_DSETLAT_Pos))
#define L2CC_DRCR_DRDLAT_Pos                  _U_(4)                                               /**< (L2CC_DRCR) Read Access Latency Position */
#define L2CC_DRCR_DRDLAT_Msk                  (_U_(0x7) << L2CC_DRCR_DRDLAT_Pos)                   /**< (L2CC_DRCR) Read Access Latency Mask */
#define L2CC_DRCR_DRDLAT(value)               (L2CC_DRCR_DRDLAT_Msk & ((value) << L2CC_DRCR_DRDLAT_Pos))
#define L2CC_DRCR_DWRLAT_Pos                  _U_(8)                                               /**< (L2CC_DRCR) Write Access Latency Position */
#define L2CC_DRCR_DWRLAT_Msk                  (_U_(0x7) << L2CC_DRCR_DWRLAT_Pos)                   /**< (L2CC_DRCR) Write Access Latency Mask */
#define L2CC_DRCR_DWRLAT(value)               (L2CC_DRCR_DWRLAT_Msk & ((value) << L2CC_DRCR_DWRLAT_Pos))
#define L2CC_DRCR_Msk                         _U_(0x00000777)                                      /**< (L2CC_DRCR) Register Mask  */


/* -------- L2CC_ECR : (L2CC Offset: 0x200) (R/W 32) Event Counter Control Register -------- */
#define L2CC_ECR_EVCEN_Pos                    _U_(0)                                               /**< (L2CC_ECR) Event Counter Enable Position */
#define L2CC_ECR_EVCEN_Msk                    (_U_(0x1) << L2CC_ECR_EVCEN_Pos)                     /**< (L2CC_ECR) Event Counter Enable Mask */
#define L2CC_ECR_EVCEN(value)                 (L2CC_ECR_EVCEN_Msk & ((value) << L2CC_ECR_EVCEN_Pos))
#define L2CC_ECR_EVC0RST_Pos                  _U_(1)                                               /**< (L2CC_ECR) Event Counter 0 Reset Position */
#define L2CC_ECR_EVC0RST_Msk                  (_U_(0x1) << L2CC_ECR_EVC0RST_Pos)                   /**< (L2CC_ECR) Event Counter 0 Reset Mask */
#define L2CC_ECR_EVC0RST(value)               (L2CC_ECR_EVC0RST_Msk & ((value) << L2CC_ECR_EVC0RST_Pos))
#define L2CC_ECR_EVC1RST_Pos                  _U_(2)                                               /**< (L2CC_ECR) Event Counter 1 Reset Position */
#define L2CC_ECR_EVC1RST_Msk                  (_U_(0x1) << L2CC_ECR_EVC1RST_Pos)                   /**< (L2CC_ECR) Event Counter 1 Reset Mask */
#define L2CC_ECR_EVC1RST(value)               (L2CC_ECR_EVC1RST_Msk & ((value) << L2CC_ECR_EVC1RST_Pos))
#define L2CC_ECR_Msk                          _U_(0x00000007)                                      /**< (L2CC_ECR) Register Mask  */


/* -------- L2CC_ECFGR1 : (L2CC Offset: 0x204) (R/W 32) Event Counter 1 Configuration Register -------- */
#define L2CC_ECFGR1_EIGEN_Pos                 _U_(0)                                               /**< (L2CC_ECFGR1) Event Counter Interrupt Generation Position */
#define L2CC_ECFGR1_EIGEN_Msk                 (_U_(0x3) << L2CC_ECFGR1_EIGEN_Pos)                  /**< (L2CC_ECFGR1) Event Counter Interrupt Generation Mask */
#define L2CC_ECFGR1_EIGEN(value)              (L2CC_ECFGR1_EIGEN_Msk & ((value) << L2CC_ECFGR1_EIGEN_Pos))
#define   L2CC_ECFGR1_EIGEN_INT_DIS_Val       _U_(0x0)                                             /**< (L2CC_ECFGR1) Disables (default)  */
#define   L2CC_ECFGR1_EIGEN_INT_EN_INCR_Val   _U_(0x1)                                             /**< (L2CC_ECFGR1) Enables with Increment condition  */
#define   L2CC_ECFGR1_EIGEN_INT_EN_OVER_Val   _U_(0x2)                                             /**< (L2CC_ECFGR1) Enables with Overflow condition  */
#define   L2CC_ECFGR1_EIGEN_INT_GEN_DIS_Val   _U_(0x3)                                             /**< (L2CC_ECFGR1) Disables Interrupt generation  */
#define L2CC_ECFGR1_EIGEN_INT_DIS             (L2CC_ECFGR1_EIGEN_INT_DIS_Val << L2CC_ECFGR1_EIGEN_Pos) /**< (L2CC_ECFGR1) Disables (default) Position  */
#define L2CC_ECFGR1_EIGEN_INT_EN_INCR         (L2CC_ECFGR1_EIGEN_INT_EN_INCR_Val << L2CC_ECFGR1_EIGEN_Pos) /**< (L2CC_ECFGR1) Enables with Increment condition Position  */
#define L2CC_ECFGR1_EIGEN_INT_EN_OVER         (L2CC_ECFGR1_EIGEN_INT_EN_OVER_Val << L2CC_ECFGR1_EIGEN_Pos) /**< (L2CC_ECFGR1) Enables with Overflow condition Position  */
#define L2CC_ECFGR1_EIGEN_INT_GEN_DIS         (L2CC_ECFGR1_EIGEN_INT_GEN_DIS_Val << L2CC_ECFGR1_EIGEN_Pos) /**< (L2CC_ECFGR1) Disables Interrupt generation Position  */
#define L2CC_ECFGR1_ESRC_Pos                  _U_(2)                                               /**< (L2CC_ECFGR1) Event Counter Source Position */
#define L2CC_ECFGR1_ESRC_Msk                  (_U_(0xF) << L2CC_ECFGR1_ESRC_Pos)                   /**< (L2CC_ECFGR1) Event Counter Source Mask */
#define L2CC_ECFGR1_ESRC(value)               (L2CC_ECFGR1_ESRC_Msk & ((value) << L2CC_ECFGR1_ESRC_Pos))
#define   L2CC_ECFGR1_ESRC_CNT_DIS_Val        _U_(0x0)                                             /**< (L2CC_ECFGR1) Counter Disabled  */
#define   L2CC_ECFGR1_ESRC_SRC_CO_Val         _U_(0x1)                                             /**< (L2CC_ECFGR1) Source is CO  */
#define   L2CC_ECFGR1_ESRC_SRC_DRHIT_Val      _U_(0x2)                                             /**< (L2CC_ECFGR1) Source is DRHIT  */
#define   L2CC_ECFGR1_ESRC_SRC_DRREQ_Val      _U_(0x3)                                             /**< (L2CC_ECFGR1) Source is DRREQ  */
#define   L2CC_ECFGR1_ESRC_SRC_DWHIT_Val      _U_(0x4)                                             /**< (L2CC_ECFGR1) Source is DWHIT  */
#define   L2CC_ECFGR1_ESRC_SRC_DWREQ_Val      _U_(0x5)                                             /**< (L2CC_ECFGR1) Source is DWREQ  */
#define   L2CC_ECFGR1_ESRC_SRC_DWTREQ_Val     _U_(0x6)                                             /**< (L2CC_ECFGR1) Source is DWTREQ  */
#define   L2CC_ECFGR1_ESRC_SRC_IRHIT_Val      _U_(0x7)                                             /**< (L2CC_ECFGR1) Source is IRHIT  */
#define   L2CC_ECFGR1_ESRC_SRC_IRREQ_Val      _U_(0x8)                                             /**< (L2CC_ECFGR1) Source is IRREQ  */
#define   L2CC_ECFGR1_ESRC_SRC_WA_Val         _U_(0x9)                                             /**< (L2CC_ECFGR1) Source is WA  */
#define   L2CC_ECFGR1_ESRC_SRC_IPFALLOC_Val   _U_(0xA)                                             /**< (L2CC_ECFGR1) Source is IPFALLOC  */
#define   L2CC_ECFGR1_ESRC_SRC_EPFHIT_Val     _U_(0xB)                                             /**< (L2CC_ECFGR1) Source is EPFHIT  */
#define   L2CC_ECFGR1_ESRC_SRC_EPFALLOC_Val   _U_(0xC)                                             /**< (L2CC_ECFGR1) Source is EPFALLOC  */
#define   L2CC_ECFGR1_ESRC_SRC_SRRCVD_Val     _U_(0xD)                                             /**< (L2CC_ECFGR1) Source is SRRCVD  */
#define   L2CC_ECFGR1_ESRC_SRC_SRCONF_Val     _U_(0xE)                                             /**< (L2CC_ECFGR1) Source is SRCONF  */
#define   L2CC_ECFGR1_ESRC_SRC_EPFRCVD_Val    _U_(0xF)                                             /**< (L2CC_ECFGR1) Source is EPFRCVD  */
#define L2CC_ECFGR1_ESRC_CNT_DIS              (L2CC_ECFGR1_ESRC_CNT_DIS_Val << L2CC_ECFGR1_ESRC_Pos) /**< (L2CC_ECFGR1) Counter Disabled Position  */
#define L2CC_ECFGR1_ESRC_SRC_CO               (L2CC_ECFGR1_ESRC_SRC_CO_Val << L2CC_ECFGR1_ESRC_Pos) /**< (L2CC_ECFGR1) Source is CO Position  */
#define L2CC_ECFGR1_ESRC_SRC_DRHIT            (L2CC_ECFGR1_ESRC_SRC_DRHIT_Val << L2CC_ECFGR1_ESRC_Pos) /**< (L2CC_ECFGR1) Source is DRHIT Position  */
#define L2CC_ECFGR1_ESRC_SRC_DRREQ            (L2CC_ECFGR1_ESRC_SRC_DRREQ_Val << L2CC_ECFGR1_ESRC_Pos) /**< (L2CC_ECFGR1) Source is DRREQ Position  */
#define L2CC_ECFGR1_ESRC_SRC_DWHIT            (L2CC_ECFGR1_ESRC_SRC_DWHIT_Val << L2CC_ECFGR1_ESRC_Pos) /**< (L2CC_ECFGR1) Source is DWHIT Position  */
#define L2CC_ECFGR1_ESRC_SRC_DWREQ            (L2CC_ECFGR1_ESRC_SRC_DWREQ_Val << L2CC_ECFGR1_ESRC_Pos) /**< (L2CC_ECFGR1) Source is DWREQ Position  */
#define L2CC_ECFGR1_ESRC_SRC_DWTREQ           (L2CC_ECFGR1_ESRC_SRC_DWTREQ_Val << L2CC_ECFGR1_ESRC_Pos) /**< (L2CC_ECFGR1) Source is DWTREQ Position  */
#define L2CC_ECFGR1_ESRC_SRC_IRHIT            (L2CC_ECFGR1_ESRC_SRC_IRHIT_Val << L2CC_ECFGR1_ESRC_Pos) /**< (L2CC_ECFGR1) Source is IRHIT Position  */
#define L2CC_ECFGR1_ESRC_SRC_IRREQ            (L2CC_ECFGR1_ESRC_SRC_IRREQ_Val << L2CC_ECFGR1_ESRC_Pos) /**< (L2CC_ECFGR1) Source is IRREQ Position  */
#define L2CC_ECFGR1_ESRC_SRC_WA               (L2CC_ECFGR1_ESRC_SRC_WA_Val << L2CC_ECFGR1_ESRC_Pos) /**< (L2CC_ECFGR1) Source is WA Position  */
#define L2CC_ECFGR1_ESRC_SRC_IPFALLOC         (L2CC_ECFGR1_ESRC_SRC_IPFALLOC_Val << L2CC_ECFGR1_ESRC_Pos) /**< (L2CC_ECFGR1) Source is IPFALLOC Position  */
#define L2CC_ECFGR1_ESRC_SRC_EPFHIT           (L2CC_ECFGR1_ESRC_SRC_EPFHIT_Val << L2CC_ECFGR1_ESRC_Pos) /**< (L2CC_ECFGR1) Source is EPFHIT Position  */
#define L2CC_ECFGR1_ESRC_SRC_EPFALLOC         (L2CC_ECFGR1_ESRC_SRC_EPFALLOC_Val << L2CC_ECFGR1_ESRC_Pos) /**< (L2CC_ECFGR1) Source is EPFALLOC Position  */
#define L2CC_ECFGR1_ESRC_SRC_SRRCVD           (L2CC_ECFGR1_ESRC_SRC_SRRCVD_Val << L2CC_ECFGR1_ESRC_Pos) /**< (L2CC_ECFGR1) Source is SRRCVD Position  */
#define L2CC_ECFGR1_ESRC_SRC_SRCONF           (L2CC_ECFGR1_ESRC_SRC_SRCONF_Val << L2CC_ECFGR1_ESRC_Pos) /**< (L2CC_ECFGR1) Source is SRCONF Position  */
#define L2CC_ECFGR1_ESRC_SRC_EPFRCVD          (L2CC_ECFGR1_ESRC_SRC_EPFRCVD_Val << L2CC_ECFGR1_ESRC_Pos) /**< (L2CC_ECFGR1) Source is EPFRCVD Position  */
#define L2CC_ECFGR1_Msk                       _U_(0x0000003F)                                      /**< (L2CC_ECFGR1) Register Mask  */


