Microchip-MPLAB-Harmony/csp/apps/cache/cache_maintenance/firmware/src/packs/ATSAMA5D27_DFP/component/l2cc.h
/* -------- L2CC_CIR : (L2CC Offset: 0x7B8) (R/W 32) Clean Index Register -------- */
#define L2CC_CIR_C_Pos                        _U_(0)                                               /**< (L2CC_CIR) Cache Synchronization Status Position */
#define L2CC_CIR_C_Msk                        (_U_(0x1) << L2CC_CIR_C_Pos)                         /**< (L2CC_CIR) Cache Synchronization Status Mask */
#define L2CC_CIR_C(value)                     (L2CC_CIR_C_Msk & ((value) << L2CC_CIR_C_Pos))
#define L2CC_CIR_IDX_Pos                      _U_(5)                                               /**< (L2CC_CIR) Index number Position */
#define L2CC_CIR_IDX_Msk                      (_U_(0x1FF) << L2CC_CIR_IDX_Pos)                     /**< (L2CC_CIR) Index number Mask */
#define L2CC_CIR_IDX(value)                   (L2CC_CIR_IDX_Msk & ((value) << L2CC_CIR_IDX_Pos))
#define L2CC_CIR_WAY_Pos                      _U_(28)                                              /**< (L2CC_CIR) Way number Position */
#define L2CC_CIR_WAY_Msk                      (_U_(0x7) << L2CC_CIR_WAY_Pos)                       /**< (L2CC_CIR) Way number Mask */
#define L2CC_CIR_WAY(value)                   (L2CC_CIR_WAY_Msk & ((value) << L2CC_CIR_WAY_Pos))
#define L2CC_CIR_Msk                          _U_(0x70003FE1)                                      /**< (L2CC_CIR) Register Mask  */


/* -------- L2CC_CWR : (L2CC Offset: 0x7BC) (R/W 32) Clean Way Register -------- */
#define L2CC_CWR_WAY0_Pos                     _U_(0)                                               /**< (L2CC_CWR) Clean Way Number 0 Position */
#define L2CC_CWR_WAY0_Msk                     (_U_(0x1) << L2CC_CWR_WAY0_Pos)                      /**< (L2CC_CWR) Clean Way Number 0 Mask */
#define L2CC_CWR_WAY0(value)                  (L2CC_CWR_WAY0_Msk & ((value) << L2CC_CWR_WAY0_Pos))
#define L2CC_CWR_WAY1_Pos                     _U_(1)                                               /**< (L2CC_CWR) Clean Way Number 1 Position */
#define L2CC_CWR_WAY1_Msk                     (_U_(0x1) << L2CC_CWR_WAY1_Pos)                      /**< (L2CC_CWR) Clean Way Number 1 Mask */
#define L2CC_CWR_WAY1(value)                  (L2CC_CWR_WAY1_Msk & ((value) << L2CC_CWR_WAY1_Pos))
#define L2CC_CWR_WAY2_Pos                     _U_(2)                                               /**< (L2CC_CWR) Clean Way Number 2 Position */
#define L2CC_CWR_WAY2_Msk                     (_U_(0x1) << L2CC_CWR_WAY2_Pos)                      /**< (L2CC_CWR) Clean Way Number 2 Mask */
#define L2CC_CWR_WAY2(value)                  (L2CC_CWR_WAY2_Msk & ((value) << L2CC_CWR_WAY2_Pos))
#define L2CC_CWR_WAY3_Pos                     _U_(3)                                               /**< (L2CC_CWR) Clean Way Number 3 Position */
#define L2CC_CWR_WAY3_Msk                     (_U_(0x1) << L2CC_CWR_WAY3_Pos)                      /**< (L2CC_CWR) Clean Way Number 3 Mask */
#define L2CC_CWR_WAY3(value)                  (L2CC_CWR_WAY3_Msk & ((value) << L2CC_CWR_WAY3_Pos))
#define L2CC_CWR_WAY4_Pos                     _U_(4)                                               /**< (L2CC_CWR) Clean Way Number 4 Position */
#define L2CC_CWR_WAY4_Msk                     (_U_(0x1) << L2CC_CWR_WAY4_Pos)                      /**< (L2CC_CWR) Clean Way Number 4 Mask */
#define L2CC_CWR_WAY4(value)                  (L2CC_CWR_WAY4_Msk & ((value) << L2CC_CWR_WAY4_Pos))
#define L2CC_CWR_WAY5_Pos                     _U_(5)                                               /**< (L2CC_CWR) Clean Way Number 5 Position */
#define L2CC_CWR_WAY5_Msk                     (_U_(0x1) << L2CC_CWR_WAY5_Pos)                      /**< (L2CC_CWR) Clean Way Number 5 Mask */
#define L2CC_CWR_WAY5(value)                  (L2CC_CWR_WAY5_Msk & ((value) << L2CC_CWR_WAY5_Pos))
#define L2CC_CWR_WAY6_Pos                     _U_(6)                                               /**< (L2CC_CWR) Clean Way Number 6 Position */
#define L2CC_CWR_WAY6_Msk                     (_U_(0x1) << L2CC_CWR_WAY6_Pos)                      /**< (L2CC_CWR) Clean Way Number 6 Mask */
#define L2CC_CWR_WAY6(value)                  (L2CC_CWR_WAY6_Msk & ((value) << L2CC_CWR_WAY6_Pos))
#define L2CC_CWR_WAY7_Pos                     _U_(7)                                               /**< (L2CC_CWR) Clean Way Number 7 Position */
#define L2CC_CWR_WAY7_Msk                     (_U_(0x1) << L2CC_CWR_WAY7_Pos)                      /**< (L2CC_CWR) Clean Way Number 7 Mask */
#define L2CC_CWR_WAY7(value)                  (L2CC_CWR_WAY7_Msk & ((value) << L2CC_CWR_WAY7_Pos))
#define L2CC_CWR_Msk                          _U_(0x000000FF)                                      /**< (L2CC_CWR) Register Mask  */

#define L2CC_CWR_WAY_Pos                      _U_(0)                                               /**< (L2CC_CWR Position) Clean Way Number 7 */
#define L2CC_CWR_WAY_Msk                      (_U_(0xFF) << L2CC_CWR_WAY_Pos)                      /**< (L2CC_CWR Mask) WAY */
#define L2CC_CWR_WAY(value)                   (L2CC_CWR_WAY_Msk & ((value) << L2CC_CWR_WAY_Pos))   

/* -------- L2CC_CIPALR : (L2CC Offset: 0x7F0) (R/W 32) Clean Invalidate Physical Address Line Register -------- */
#define L2CC_CIPALR_C_Pos                     _U_(0)                                               /**< (L2CC_CIPALR) Cache Synchronization Status Position */
#define L2CC_CIPALR_C_Msk                     (_U_(0x1) << L2CC_CIPALR_C_Pos)                      /**< (L2CC_CIPALR) Cache Synchronization Status Mask */
#define L2CC_CIPALR_C(value)                  (L2CC_CIPALR_C_Msk & ((value) << L2CC_CIPALR_C_Pos))
#define L2CC_CIPALR_IDX_Pos                   _U_(5)                                               /**< (L2CC_CIPALR) Index Number Position */
#define L2CC_CIPALR_IDX_Msk                   (_U_(0x1FF) << L2CC_CIPALR_IDX_Pos)                  /**< (L2CC_CIPALR) Index Number Mask */
#define L2CC_CIPALR_IDX(value)                (L2CC_CIPALR_IDX_Msk & ((value) << L2CC_CIPALR_IDX_Pos))
#define L2CC_CIPALR_TAG_Pos                   _U_(14)                                              /**< (L2CC_CIPALR) Tag Number Position */
#define L2CC_CIPALR_TAG_Msk                   (_U_(0x3FFFF) << L2CC_CIPALR_TAG_Pos)                /**< (L2CC_CIPALR) Tag Number Mask */
#define L2CC_CIPALR_TAG(value)                (L2CC_CIPALR_TAG_Msk & ((value) << L2CC_CIPALR_TAG_Pos))
#define L2CC_CIPALR_Msk                       _U_(0xFFFFFFE1)                                      /**< (L2CC_CIPALR) Register Mask  */


/* -------- L2CC_CIIR : (L2CC Offset: 0x7F8) (R/W 32) Clean Invalidate Index Register -------- */
#define L2CC_CIIR_C_Pos                       _U_(0)                                               /**< (L2CC_CIIR) Cache Synchronization Status Position */
#define L2CC_CIIR_C_Msk                       (_U_(0x1) << L2CC_CIIR_C_Pos)                        /**< (L2CC_CIIR) Cache Synchronization Status Mask */
#define L2CC_CIIR_C(value)                    (L2CC_CIIR_C_Msk & ((value) << L2CC_CIIR_C_Pos))
#define L2CC_CIIR_IDX_Pos                     _U_(5)                                               /**< (L2CC_CIIR) Index Number Position */
#define L2CC_CIIR_IDX_Msk                     (_U_(0x1FF) << L2CC_CIIR_IDX_Pos)                    /**< (L2CC_CIIR) Index Number Mask */
#define L2CC_CIIR_IDX(value)                  (L2CC_CIIR_IDX_Msk & ((value) << L2CC_CIIR_IDX_Pos))
#define L2CC_CIIR_WAY_Pos                     _U_(28)                                              /**< (L2CC_CIIR) Way Number Position */
#define L2CC_CIIR_WAY_Msk                     (_U_(0x7) << L2CC_CIIR_WAY_Pos)                      /**< (L2CC_CIIR) Way Number Mask */
#define L2CC_CIIR_WAY(value)                  (L2CC_CIIR_WAY_Msk & ((value) << L2CC_CIIR_WAY_Pos))
#define L2CC_CIIR_Msk                         _U_(0x70003FE1)                                      /**< (L2CC_CIIR) Register Mask  */


/* -------- L2CC_CIWR : (L2CC Offset: 0x7FC) (R/W 32) Clean Invalidate Way Register -------- */
#define L2CC_CIWR_WAY0_Pos                    _U_(0)                                               /**< (L2CC_CIWR) Clean Invalidate Way Number 0 Position */
#define L2CC_CIWR_WAY0_Msk                    (_U_(0x1) << L2CC_CIWR_WAY0_Pos)                     /**< (L2CC_CIWR) Clean Invalidate Way Number 0 Mask */
#define L2CC_CIWR_WAY0(value)                 (L2CC_CIWR_WAY0_Msk & ((value) << L2CC_CIWR_WAY0_Pos))
#define L2CC_CIWR_WAY1_Pos                    _U_(1)                                               /**< (L2CC_CIWR) Clean Invalidate Way Number 1 Position */
#define L2CC_CIWR_WAY1_Msk                    (_U_(0x1) << L2CC_CIWR_WAY1_Pos)                     /**< (L2CC_CIWR) Clean Invalidate Way Number 1 Mask */
#define L2CC_CIWR_WAY1(value)                 (L2CC_CIWR_WAY1_Msk & ((value) << L2CC_CIWR_WAY1_Pos))
#define L2CC_CIWR_WAY2_Pos                    _U_(2)                                               /**< (L2CC_CIWR) Clean Invalidate Way Number 2 Position */
#define L2CC_CIWR_WAY2_Msk                    (_U_(0x1) << L2CC_CIWR_WAY2_Pos)                     /**< (L2CC_CIWR) Clean Invalidate Way Number 2 Mask */
#define L2CC_CIWR_WAY2(value)                 (L2CC_CIWR_WAY2_Msk & ((value) << L2CC_CIWR_WAY2_Pos))
#define L2CC_CIWR_WAY3_Pos                    _U_(3)                                               /**< (L2CC_CIWR) Clean Invalidate Way Number 3 Position */
#define L2CC_CIWR_WAY3_Msk                    (_U_(0x1) << L2CC_CIWR_WAY3_Pos)                     /**< (L2CC_CIWR) Clean Invalidate Way Number 3 Mask */
#define L2CC_CIWR_WAY3(value)                 (L2CC_CIWR_WAY3_Msk & ((value) << L2CC_CIWR_WAY3_Pos))
#define L2CC_CIWR_WAY4_Pos                    _U_(4)                                               /**< (L2CC_CIWR) Clean Invalidate Way Number 4 Position */
#define L2CC_CIWR_WAY4_Msk                    (_U_(0x1) << L2CC_CIWR_WAY4_Pos)                     /**< (L2CC_CIWR) Clean Invalidate Way Number 4 Mask */
#define L2CC_CIWR_WAY4(value)                 (L2CC_CIWR_WAY4_Msk & ((value) << L2CC_CIWR_WAY4_Pos))
#define L2CC_CIWR_WAY5_Pos                    _U_(5)                                               /**< (L2CC_CIWR) Clean Invalidate Way Number 5 Position */
#define L2CC_CIWR_WAY5_Msk                    (_U_(0x1) << L2CC_CIWR_WAY5_Pos)                     /**< (L2CC_CIWR) Clean Invalidate Way Number 5 Mask */
#define L2CC_CIWR_WAY5(value)                 (L2CC_CIWR_WAY5_Msk & ((value) << L2CC_CIWR_WAY5_Pos))
#define L2CC_CIWR_WAY6_Pos                    _U_(6)                                               /**< (L2CC_CIWR) Clean Invalidate Way Number 6 Position */
#define L2CC_CIWR_WAY6_Msk                    (_U_(0x1) << L2CC_CIWR_WAY6_Pos)                     /**< (L2CC_CIWR) Clean Invalidate Way Number 6 Mask */
#define L2CC_CIWR_WAY6(value)                 (L2CC_CIWR_WAY6_Msk & ((value) << L2CC_CIWR_WAY6_Pos))
#define L2CC_CIWR_WAY7_Pos                    _U_(7)                                               /**< (L2CC_CIWR) Clean Invalidate Way Number 7 Position */
#define L2CC_CIWR_WAY7_Msk                    (_U_(0x1) << L2CC_CIWR_WAY7_Pos)                     /**< (L2CC_CIWR) Clean Invalidate Way Number 7 Mask */
#define L2CC_CIWR_WAY7(value)                 (L2CC_CIWR_WAY7_Msk & ((value) << L2CC_CIWR_WAY7_Pos))
#define L2CC_CIWR_Msk                         _U_(0x000000FF)                                      /**< (L2CC_CIWR) Register Mask  */

#define L2CC_CIWR_WAY_Pos                     _U_(0)                                               /**< (L2CC_CIWR Position) Clean Invalidate Way Number 7 */
#define L2CC_CIWR_WAY_Msk                     (_U_(0xFF) << L2CC_CIWR_WAY_Pos)                     /**< (L2CC_CIWR Mask) WAY */
#define L2CC_CIWR_WAY(value)                  (L2CC_CIWR_WAY_Msk & ((value) << L2CC_CIWR_WAY_Pos)) 

/* -------- L2CC_DLKR : (L2CC Offset: 0x900) (R/W 32) Data Lockdown Register -------- */
#define L2CC_DLKR_DLK0_Pos                    _U_(0)                                               /**< (L2CC_DLKR) Data Lockdown in Way Number 0 Position */
#define L2CC_DLKR_DLK0_Msk                    (_U_(0x1) << L2CC_DLKR_DLK0_Pos)                     /**< (L2CC_DLKR) Data Lockdown in Way Number 0 Mask */
#define L2CC_DLKR_DLK0(value)                 (L2CC_DLKR_DLK0_Msk & ((value) << L2CC_DLKR_DLK0_Pos))
#define L2CC_DLKR_DLK1_Pos                    _U_(1)                                               /**< (L2CC_DLKR) Data Lockdown in Way Number 1 Position */
#define L2CC_DLKR_DLK1_Msk                    (_U_(0x1) << L2CC_DLKR_DLK1_Pos)                     /**< (L2CC_DLKR) Data Lockdown in Way Number 1 Mask */
#define L2CC_DLKR_DLK1(value)                 (L2CC_DLKR_DLK1_Msk & ((value) << L2CC_DLKR_DLK1_Pos))
#define L2CC_DLKR_DLK2_Pos                    _U_(2)                                               /**< (L2CC_DLKR) Data Lockdown in Way Number 2 Position */
#define L2CC_DLKR_DLK2_Msk                    (_U_(0x1) << L2CC_DLKR_DLK2_Pos)                     /**< (L2CC_DLKR) Data Lockdown in Way Number 2 Mask */
#define L2CC_DLKR_DLK2(value)                 (L2CC_DLKR_DLK2_Msk & ((value) << L2CC_DLKR_DLK2_Pos))
#define L2CC_DLKR_DLK3_Pos                    _U_(3)                                               /**< (L2CC_DLKR) Data Lockdown in Way Number 3 Position */
#define L2CC_DLKR_DLK3_Msk                    (_U_(0x1) << L2CC_DLKR_DLK3_Pos)                     /**< (L2CC_DLKR) Data Lockdown in Way Number 3 Mask */
#define L2CC_DLKR_DLK3(value)                 (L2CC_DLKR_DLK3_Msk & ((value) << L2CC_DLKR_DLK3_Pos))
#define L2CC_DLKR_DLK4_Pos                    _U_(4)                                               /**< (L2CC_DLKR) Data Lockdown in Way Number 4 Position */
#define L2CC_DLKR_DLK4_Msk                    (_U_(0x1) << L2CC_DLKR_DLK4_Pos)                     /**< (L2CC_DLKR) Data Lockdown in Way Number 4 Mask */
#define L2CC_DLKR_DLK4(value)                 (L2CC_DLKR_DLK4_Msk & ((value) << L2CC_DLKR_DLK4_Pos))
#define L2CC_DLKR_DLK5_Pos                    _U_(5)                                               /**< (L2CC_DLKR) Data Lockdown in Way Number 5 Position */
#define L2CC_DLKR_DLK5_Msk                    (_U_(0x1) << L2CC_DLKR_DLK5_Pos)                     /**< (L2CC_DLKR) Data Lockdown in Way Number 5 Mask */
#define L2CC_DLKR_DLK5(value)                 (L2CC_DLKR_DLK5_Msk & ((value) << L2CC_DLKR_DLK5_Pos))
#define L2CC_DLKR_DLK6_Pos                    _U_(6)                                               /**< (L2CC_DLKR) Data Lockdown in Way Number 6 Position */
#define L2CC_DLKR_DLK6_Msk                    (_U_(0x1) << L2CC_DLKR_DLK6_Pos)                     /**< (L2CC_DLKR) Data Lockdown in Way Number 6 Mask */
#define L2CC_DLKR_DLK6(value)                 (L2CC_DLKR_DLK6_Msk & ((value) << L2CC_DLKR_DLK6_Pos))
#define L2CC_DLKR_DLK7_Pos                    _U_(7)                                               /**< (L2CC_DLKR) Data Lockdown in Way Number 7 Position */
#define L2CC_DLKR_DLK7_Msk                    (_U_(0x1) << L2CC_DLKR_DLK7_Pos)                     /**< (L2CC_DLKR) Data Lockdown in Way Number 7 Mask */
#define L2CC_DLKR_DLK7(value)                 (L2CC_DLKR_DLK7_Msk & ((value) << L2CC_DLKR_DLK7_Pos))
#define L2CC_DLKR_Msk                         _U_(0x000000FF)                                      /**< (L2CC_DLKR) Register Mask  */

#define L2CC_DLKR_DLK_Pos                     _U_(0)                                               /**< (L2CC_DLKR Position) Data Lockdown in Way Number 7 */
#define L2CC_DLKR_DLK_Msk                     (_U_(0xFF) << L2CC_DLKR_DLK_Pos)                     /**< (L2CC_DLKR Mask) DLK */
#define L2CC_DLKR_DLK(value)                  (L2CC_DLKR_DLK_Msk & ((value) << L2CC_DLKR_DLK_Pos)) 

