Microchip-MPLAB-Harmony/csp/apps/cache/cache_maintenance/firmware/src/packs/ATSAMA5D27_DFP/component/l2cc.h
/** \brief L2CC register offsets definitions */
#define L2CC_IDR_REG_OFST              (0x00)              /**< (L2CC_IDR) Cache ID Register Offset */
#define L2CC_TYPR_REG_OFST             (0x04)              /**< (L2CC_TYPR) Cache Type Register Offset */
#define L2CC_CR_REG_OFST               (0x100)             /**< (L2CC_CR) Control Register Offset */
#define L2CC_ACR_REG_OFST              (0x104)             /**< (L2CC_ACR) Auxiliary Control Register Offset */
#define L2CC_TRCR_REG_OFST             (0x108)             /**< (L2CC_TRCR) Tag RAM Control Register Offset */
#define L2CC_DRCR_REG_OFST             (0x10C)             /**< (L2CC_DRCR) Data RAM Control Register Offset */
#define L2CC_ECR_REG_OFST              (0x200)             /**< (L2CC_ECR) Event Counter Control Register Offset */
#define L2CC_ECFGR1_REG_OFST           (0x204)             /**< (L2CC_ECFGR1) Event Counter 1 Configuration Register Offset */
#define L2CC_ECFGR0_REG_OFST           (0x208)             /**< (L2CC_ECFGR0) Event Counter 0 Configuration Register Offset */
#define L2CC_EVR1_REG_OFST             (0x20C)             /**< (L2CC_EVR1) Event Counter 1 Value Register Offset */
#define L2CC_EVR0_REG_OFST             (0x210)             /**< (L2CC_EVR0) Event Counter 0 Value Register Offset */
#define L2CC_IMR_REG_OFST              (0x214)             /**< (L2CC_IMR) Interrupt Mask Register Offset */
#define L2CC_MISR_REG_OFST             (0x218)             /**< (L2CC_MISR) Masked Interrupt Status Register Offset */
#define L2CC_RISR_REG_OFST             (0x21C)             /**< (L2CC_RISR) Raw Interrupt Status Register Offset */
#define L2CC_ICR_REG_OFST              (0x220)             /**< (L2CC_ICR) Interrupt Clear Register Offset */
#define L2CC_CSR_REG_OFST              (0x730)             /**< (L2CC_CSR) Cache Synchronization Register Offset */
#define L2CC_IPALR_REG_OFST            (0x770)             /**< (L2CC_IPALR) Invalidate Physical Address Line Register Offset */
#define L2CC_IWR_REG_OFST              (0x77C)             /**< (L2CC_IWR) Invalidate Way Register Offset */
#define L2CC_CPALR_REG_OFST            (0x7B0)             /**< (L2CC_CPALR) Clean Physical Address Line Register Offset */
#define L2CC_CIR_REG_OFST              (0x7B8)             /**< (L2CC_CIR) Clean Index Register Offset */
#define L2CC_CWR_REG_OFST              (0x7BC)             /**< (L2CC_CWR) Clean Way Register Offset */
#define L2CC_CIPALR_REG_OFST           (0x7F0)             /**< (L2CC_CIPALR) Clean Invalidate Physical Address Line Register Offset */
#define L2CC_CIIR_REG_OFST             (0x7F8)             /**< (L2CC_CIIR) Clean Invalidate Index Register Offset */
#define L2CC_CIWR_REG_OFST             (0x7FC)             /**< (L2CC_CIWR) Clean Invalidate Way Register Offset */
#define L2CC_DLKR_REG_OFST             (0x900)             /**< (L2CC_DLKR) Data Lockdown Register Offset */
#define L2CC_ILKR_REG_OFST             (0x904)             /**< (L2CC_ILKR) Instruction Lockdown Register Offset */
#define L2CC_DCR_REG_OFST              (0xF40)             /**< (L2CC_DCR) Debug Control Register Offset */
#define L2CC_PCR_REG_OFST              (0xF60)             /**< (L2CC_PCR) Prefetch Control Register Offset */
#define L2CC_POWCR_REG_OFST            (0xF80)             /**< (L2CC_POWCR) Power Control Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief L2CC register API structure */
typedef struct
{
  __I   uint32_t                       L2CC_IDR;        /**< Offset: 0x00 (R/   32) Cache ID Register */
  __I   uint32_t                       L2CC_TYPR;       /**< Offset: 0x04 (R/   32) Cache Type Register */
  __I   uint8_t                        Reserved1[0xF8];
  __IO  uint32_t                       L2CC_CR;         /**< Offset: 0x100 (R/W  32) Control Register */
  __IO  uint32_t                       L2CC_ACR;        /**< Offset: 0x104 (R/W  32) Auxiliary Control Register */
  __IO  uint32_t                       L2CC_TRCR;       /**< Offset: 0x108 (R/W  32) Tag RAM Control Register */
  __IO  uint32_t                       L2CC_DRCR;          /**< Offset: 0x10C (R/W  32) Data RAM Control Register */
  __I   uint8_t                        Reserved2[0xF0];
  __IO  uint32_t                       L2CC_ECR;        /**< Offset: 0x200 (R/W  32) Event Counter Control Register */
  __IO  uint32_t                       L2CC_ECFGR1;     /**< Offset: 0x204 (R/W  32) Event Counter 1 Configuration Register */
  __IO  uint32_t                       L2CC_ECFGR0;     /**< Offset: 0x208 (R/W  32) Event Counter 0 Configuration Register */
  __IO  uint32_t                       L2CC_EVR1;          /**< Offset: 0x20C (R/W  32) Event Counter 1 Value Register */
  __IO  uint32_t                       L2CC_EVR0;       /**< Offset: 0x210 (R/W  32) Event Counter 0 Value Register */
  __IO  uint32_t                       L2CC_IMR;        /**< Offset: 0x214 (R/W  32) Interrupt Mask Register */
  __I   uint32_t                       L2CC_MISR;       /**< Offset: 0x218 (R/   32) Masked Interrupt Status Register */
  __I   uint32_t                       L2CC_RISR;          /**< Offset: 0x21C (R/   32) Raw Interrupt Status Register */
  __IO  uint32_t                       L2CC_ICR;        /**< Offset: 0x220 (R/W  32) Interrupt Clear Register */
  __I   uint8_t                        Reserved3[0x50C];
  __IO  uint32_t                       L2CC_CSR;        /**< Offset: 0x730 (R/W  32) Cache Synchronization Register */
  __I   uint8_t                        Reserved4[0x3C];
  __IO  uint32_t                       L2CC_IPALR;      /**< Offset: 0x770 (R/W  32) Invalidate Physical Address Line Register */
  __I   uint8_t                        Reserved5[0x08];
  __IO  uint32_t                       L2CC_IWR;           /**< Offset: 0x77C (R/W  32) Invalidate Way Register */
  __I   uint8_t                        Reserved6[0x30];
  __IO  uint32_t                       L2CC_CPALR;         /**< Offset: 0x7B0 (R/W  32) Clean Physical Address Line Register */
  __I   uint8_t                        Reserved7[0x04];
  __IO  uint32_t                       L2CC_CIR;           /**< Offset: 0x7B8 (R/W  32) Clean Index Register */
  __IO  uint32_t                       L2CC_CWR;           /**< Offset: 0x7BC (R/W  32) Clean Way Register */
  __I   uint8_t                        Reserved8[0x30];
  __IO  uint32_t                       L2CC_CIPALR;        /**< Offset: 0x7F0 (R/W  32) Clean Invalidate Physical Address Line Register */
  __I   uint8_t                        Reserved9[0x04];
  __IO  uint32_t                       L2CC_CIIR;          /**< Offset: 0x7F8 (R/W  32) Clean Invalidate Index Register */
  __IO  uint32_t                       L2CC_CIWR;          /**< Offset: 0x7FC (R/W  32) Clean Invalidate Way Register */
  __I   uint8_t                        Reserved10[0x100];
  __IO  uint32_t                       L2CC_DLKR;       /**< Offset: 0x900 (R/W  32) Data Lockdown Register */
  __IO  uint32_t                       L2CC_ILKR;       /**< Offset: 0x904 (R/W  32) Instruction Lockdown Register */
  __I   uint8_t                        Reserved11[0x638];
  __IO  uint32_t                       L2CC_DCR;           /**< Offset: 0xF40 (R/W  32) Debug Control Register */
  __I   uint8_t                        Reserved12[0x1C];
  __IO  uint32_t                       L2CC_PCR;           /**< Offset: 0xF60 (R/W  32) Prefetch Control Register */
  __I   uint8_t                        Reserved13[0x1C];
  __IO  uint32_t                       L2CC_POWCR;         /**< Offset: 0xF80 (R/W  32) Power Control Register */
} l2cc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMA5D2_L2CC_COMPONENT_H_ */
